Ran Plan for 9 projects:

1. project: `marketplace-ecr-prod` dir: `terraform/environments/prod/ecr` workspace: `default`
1. project: `marketplace-ecs-cluster-prod` dir: `terraform/environments/prod/ecs-cluster` workspace: `default`
1. project: `marketplace-elasticache-prod` dir: `terraform/environments/prod/elasticache` workspace: `default`
1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
1. project: `marketplace-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
1. project: `marketplace-ecs-cluster-stage` dir: `terraform/environments/stage/ecs-cluster` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
---

### 1. project: `marketplace-ecr-prod` dir: `terraform/environments/prod/ecr` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecr/marketplace-ecr-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecr": exit status 1
module.ecr_web_api.data.aws_caller_identity.current: Reading...
module.ecr_scheduler.data.aws_caller_identity.current: Reading...
module.ecr_scheduler.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecr_web_api.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Resource precondition failed
│ 
│   on .terraform/modules/ecr_scheduler/terraform/modules/ecr/main.tf line 41, in resource "aws_ecr_repository" "this":
│   41:       condition     = var.encryption_type != "KMS" || var.kms_key_arn != null
│     ├────────────────
│     │ var.encryption_type is "KMS"
│     │ var.kms_key_arn is null
│ 
│ encryption_type이 'KMS'인 경우 kms_key_arn 변수도 반드시 설정해야 합니다.
╵
╷
│ Error: Resource precondition failed
│ 
│   on .terraform/modules/ecr_web_api/terraform/modules/ecr/main.tf line 41, in resource "aws_ecr_repository" "this":
│   41:       condition     = var.encryption_type != "KMS" || var.kms_key_arn != null
│     ├────────────────
│     │ var.encryption_type is "KMS"
│     │ var.kms_key_arn is null
│ 
│ encryption_type이 'KMS'인 경우 kms_key_arn 변수도 반드시 설정해야 합니다.
╵


```
</details>

---
### 2. project: `marketplace-ecs-cluster-prod` dir: `terraform/environments/prod/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "marketplace-cluster-prod"
      + tags     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-ecs-cluster"
        }
      + tags_all = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "marketplace-cluster-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # aws_ssm_parameter.cluster_arn will be created
+ resource "aws_ssm_parameter" "cluster_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace ECS cluster ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/ecs/cluster-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "marketplace-ecs-cluster-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-ecs-cluster-arn"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_name will be created
+ resource "aws_ssm_parameter" "cluster_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace ECS cluster name"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/ecs/cluster-name"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "marketplace-ecs-cluster-name"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-ecs-cluster-name"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "marketplace-cluster-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-cluster-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `marketplace-elasticache-prod` dir: `terraform/environments/prod/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for ElastiCache Redis"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Redis from ECS tasks"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "marketplace-redis-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace Redis endpoint"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/elasticache/redis-endpoint"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "marketplace-redis-endpoint"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-endpoint"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MarketPlace Redis port"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/elasticache/redis-port"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "marketplace-redis-port"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-port"
          + "Project"     = "marketplace"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.redis.aws_cloudwatch_metric_alarm.connections[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "connections" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache marketplace-redis-prod - Connection count is too high"
      + alarm_name                            = "marketplace-redis-prod-connection-count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "marketplace-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + threshold                             = 1000
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.cpu[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache marketplace-redis-prod - CPU utilization is too high"
      + alarm_name                            = "marketplace-redis-prod-cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "marketplace-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.memory[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "memory" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache marketplace-redis-prod - Memory utilization is too high"
      + alarm_name                            = "marketplace-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "marketplace-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_elasticache_cluster.memcached-or-single-redis[0] will be created
+ resource "aws_elasticache_cluster" "memcached-or-single-redis" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = "single-az"
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "marketplace-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:09:00-mon:10:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "marketplace-redis-prod-parameter-group"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 1
      + snapshot_window            = "05:00-09:00"
      + subnet_group_name          = "marketplace-redis-prod-subnet-group"
      + tags                       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.redis.aws_elasticache_parameter_group.this[0] will be created
+ resource "aws_elasticache_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "marketplace-redis-prod-parameter-group"
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
      + parameter {
          + name  = "notify-keyspace-events"
          + value = "Ex"
        }
    }

  # module.redis.aws_elasticache_subnet_group.this will be created
+ resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "marketplace-redis-prod-subnet-group"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-redis"
        }
      + vpc_id      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ redis_endpoint = (known after apply)
+ redis_port     = 6379
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-elasticache-prod
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
### 4. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecs-web-api/marketplace-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecs-web-api": exit status 1
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ecs_cluster.main: Reading...
module.web_api_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
module.web_api_task_role.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
module.web_api_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_secretsmanager_secret.rds: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.vpc_id: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_task_execution_role.data.aws_region.current: Reading...
module.web_api_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.ses_access_key_id: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.ses_secret_access_key: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
module.web_api_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ecr_repository.web_api: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
data.aws_ssm_parameter.service_token_secret: Reading...
module.web_api_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_vpc.main: Reading...
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_ssm_parameter.ses_access_key_id: Read complete after 0s [id=/marketplace/ses/access-key-id]
data.aws_ssm_parameter.ses_secret_access_key: Read complete after 0s [id=/marketplace/ses/secret-access-key]
data.aws_ssm_parameter.service_token_secret: Read complete after 0s [id=/shared/security/service-token-secret]
data.aws_vpc.main: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.logs will be created
  + resource "aws_kms_alias" "logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/marketplace-web-api-logs-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.logs will be created
  + resource "aws_kms_key" "logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for MarketPlace web-api CloudWatch logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/marketplace-web-api-prod/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-web-api-logs-kms-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-web-api"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-web-api-logs-kms-prod"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-web-api"
          + "team"         = "platform-team"
        }
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for web-api ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "marketplace-web-api-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "VPC internal traffic only (API Gateway, Service Discovery)"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + to_port                = 8080
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "marketplace-api-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/marketplace-web-api-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-web-api-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-web-api-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.web_api_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "marketplace-web-api-execution-role-prod"
    }

  # module.web_api_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-web-api-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-web-api-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-task-role-prod-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingRules",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "XRayTracing"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel:*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/marketplace/otel-collector:*",
                        ]
                      + Sid      = "CloudWatchLogsAccess"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "MarketPlace"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudWatchMetricsAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-connectly/*"
                      + Sid      = "S3ConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.web_api_task_role.aws_iam_role_policy.custom["ses-access"] will be created
  + resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "marketplace-web-api-task-role-prod-ses-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_discovery_dns = "marketplace-api.connectly.local"
╷
│ Error: reading ECR Repository (marketplace-web-api-prod): couldn't find resource
│ 
│   with data.aws_ecr_repository.web_api,
│   on main.tf line 33, in data "aws_ecr_repository" "web_api":
│   33: data "aws_ecr_repository" "web_api" {
│ 
╵
╷
│ Error: reading ECS Cluster (marketplace-cluster-prod): empty result
│ 
│   with data.aws_ecs_cluster.main,
│   on main.tf line 40, in data "aws_ecs_cluster" "main":
│   40: data "aws_ecs_cluster" "main" {
│ 
╵
╷
│ Error: reading Secrets Manager Secret (marketplace/rds/credentials): couldn't find resource
│ 
│   with data.aws_secretsmanager_secret.rds,
│   on provider.tf line 110, in data "aws_secretsmanager_secret" "rds":
│  110: data "aws_secretsmanager_secret" "rds" {
│ 
╵

```
</details>

---
### 5. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecs-scheduler/marketplace-ecs-scheduler-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/1/default/terraform/environments/prod/ecs-scheduler": exit status 1
module.scheduler_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
data.aws_ssm_parameter.ses_sender_email: Reading...
module.scheduler_task_execution_role.data.aws_region.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ecr_repository.scheduler: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Reading...
module.scheduler_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.vpc_id: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
module.ecs_service.data.aws_region.current: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_ssm_parameter.private_subnets: Reading...
module.scheduler_task_role.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.ses_sender_email: Read complete after 0s [id=/marketplace/ses/sender-email]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_secretsmanager_secret.rds: Reading...
module.scheduler_task_execution_role.data.aws_caller_identity.current: Reading...
module.scheduler_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
module.scheduler_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_vpc.main: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_vpc.main: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.logs will be created
  + resource "aws_kms_alias" "logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/marketplace-scheduler-logs-prod"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.logs will be created
  + resource "aws_kms_key" "logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for MarketPlace scheduler CloudWatch logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/marketplace-scheduler-prod/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-scheduler-logs-kms-prod"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-scheduler"
          + "team"         = "platform-team"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Lifecycle"    = "production"
          + "ManagedBy"    = "terraform"
          + "Name"         = "marketplace-scheduler-logs-kms-prod"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-scheduler"
          + "team"         = "platform-team"
        }
    }

  # module.ecs_security_group.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for scheduler ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "marketplace-scheduler-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "VPC internal traffic only (Health check, Service Discovery)"
      + from_port              = 8081
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + to_port                = 8081
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "marketplace-scheduler-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-scheduler-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for marketplace-scheduler-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.scheduler_logs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/marketplace-scheduler-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for marketplace-scheduler-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "marketplace-scheduler-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "marketplace-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "marketplace"
          + "Service"     = "marketplace-scheduler"
        }
      + unique_id             = (known after 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.